
===========================================================================
report_parasitic_annotation -report_unannotated
============================================================================
Found 0 unannotated drivers.
Found 0 partially unannotated drivers.
parastic_annotation_check
check_slew

===========================================================================
 report_check_types -max_slew -max_cap -max_fanout -violators
============================================================================

===========================================================================
max slew violation count 0
max fanout violation count 0
max cap violation count 0
============================================================================
check_slew_end
tns_report

===========================================================================
 report_tns
============================================================================
tns 0.00
tns_report_end
wns_report

===========================================================================
 report_wns
============================================================================
wns 0.00
wns_report_end
worst_slack

===========================================================================
 report_worst_slack -max (Setup)
============================================================================
worst slack 4.14

===========================================================================
 report_worst_slack -min (Hold)
============================================================================
worst slack 4.90
worst_slack_end
power_report

===========================================================================
 report_power
============================================================================
Group                  Internal  Switching    Leakage      Total
                          Power      Power      Power      Power (Watts)
----------------------------------------------------------------
Sequential             0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Combinational          2.82e-06   1.15e-05   4.68e-08   1.44e-05 100.0%
Macro                  0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Pad                    0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
----------------------------------------------------------------
Total                  2.82e-06   1.15e-05   4.68e-08   1.44e-05 100.0%
                          19.7%      80.0%       0.3%
power_report_end
area_report

===========================================================================
 report_design_area
============================================================================
Design area 3346 u^2 11% utilization.
area_report_end
Setting global connections for newly added cells...
[WARNING] Did not save OpenROAD database!
Writing SDF to /usr/local/google/home/sachinnadig/MixedSignal_ENV/GF180_GAFE_1/digital/runs/RUN_2023.02.14_02.16.20/results/routing/mca/process_corner_nom/top.sdf...
Writing timing model to /usr/local/google/home/sachinnadig/MixedSignal_ENV/GF180_GAFE_1/digital/runs/RUN_2023.02.14_02.16.20/results/routing/mca/process_corner_nom/top.lib...

