
===========================================================================
report_parasitic_annotation -report_unannotated
============================================================================
Found 3 unannotated drivers.
 osc_en
 _0_/Z
 osc0/Y
Found 0 partially unannotated drivers.
parastic_annotation_check
check_slew

===========================================================================
 report_check_types -max_slew -max_cap -max_fanout -violators
============================================================================

===========================================================================
max slew violation count 0
max fanout violation count 0
max cap violation count 0
============================================================================
check_slew_end
tns_report

===========================================================================
 report_tns
============================================================================
tns 0.00
tns_report_end
wns_report

===========================================================================
 report_wns
============================================================================
wns 0.00
wns_report_end
worst_slack

===========================================================================
 report_worst_slack -max (Setup)
============================================================================
worst slack 4.38

===========================================================================
 report_worst_slack -min (Hold)
============================================================================
worst slack 4.62
worst_slack_end
power_report

===========================================================================
 report_power
============================================================================
Group                  Internal  Switching    Leakage      Total
                          Power      Power      Power      Power (Watts)
----------------------------------------------------------------
Sequential             0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Combinational          1.51e-06   9.11e-06   1.44e-08   1.06e-05 100.0%
Macro                  0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Pad                    0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
----------------------------------------------------------------
Total                  1.51e-06   9.11e-06   1.44e-08   1.06e-05 100.0%
                          14.2%      85.6%       0.1%
power_report_end
area_report

===========================================================================
 report_design_area
============================================================================
Design area 3320 u^2 11% utilization.
area_report_end
Setting global connections for newly added cells...
Writing OpenROAD database to /usr/local/google/home/sachinnadig/MixedSignal_ENV/GF180_GAFE_1/digital/runs/RUN_2023.02.14_02.16.20/tmp/placement/8-global.odb...
Writing layout to /usr/local/google/home/sachinnadig/MixedSignal_ENV/GF180_GAFE_1/digital/runs/RUN_2023.02.14_02.16.20/tmp/placement/8-global.def...

